/************************************************/
/* 比較自訂Hormonic函數與standard lib函數差別		*/
/* 以log為例子																	*/
/*																							*/
/*																							*/
/*	num:	Hormonic(n)	std lib(n):								*/
/*	10		2.92897			3.32193										*/
/*	11		3.01988			3.45943										*/
/*	12		3.10321			3.58496										*/
/*	13		3.18013			3.70044										*/
/*	14		3.25156			3.80735										*/
/*	15		3.31823			3.90689										*/
/*	16		3.38073			4													*/
/*	17		3.43955			4.08746										*/
/*	18		3.49511			4.16993										*/
/*	19		3.54774			4.24793										*/
/*	20		3.59774			4.32193										*/
/*	21		3.64536			4.39232										*/
/*	22		3.69081			4.45943										*/
/*	23		3.73429			4.52356										*/
/*	24		3.77596			4.58496										*/
/*	25		3.81596			4.64386										*/
/*	26		3.85442			4.70044										*/
/*	27		3.89146			4.75489										*/
/*	28		3.92717			4.80735										*/
/*	29		3.96165			4.85798										*/
/************************************************/
#include<iostream>
#include<cmath>
using namespace std;

// return 1/1 + 1/2 + 1/3 + ... + 1/n
double hormonic(int n)
{
	double sum=0;
	for(int i = 1; i < n+1 ; i++)
		sum += 1/ ( (double)i);
	return sum;
}

int main(){
	cout <<"num:\tHormonic(n)\tstd lib(n):" << endl;
	for(int n =10 ; n<30; n++)
	{
		cout << "Hand make function log("  << n << "): 	" << hormonic(n) << endl;
		cout << "standard lib function log("<< n << "): 	" << log(n)/log(2) << endl;
	}
}
